jmeter/player-gateway/inventory/inventory_read.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Data search">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Data search thread group">
        <intProp name="ThreadGroup.num_threads">400</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">90</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Search data HTTP Request">
          <stringProp name="HTTPSampler.domain">player.shooter.local</stringProp>
          <stringProp name="HTTPSampler.port">80</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/players/current/inventory?count=100&amp;page=0</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer eyJhbGciOiJSUzI1NiIsInR5cCIgOiAiSldUIiwia2lkIiA6ICI0SklpS3lnZjZlM0pnajlzNFQ5SFBFM2JVdWJJSVA1WjlHRGlId2Z6cnYwIn0.eyJleHAiOjE3NzI1NzM2NjQsImlhdCI6MTc3MjU3MDA2NCwiYXV0aF90aW1lIjoxNzcyNTcwMDY0LCJqdGkiOiJvbnJ0YWM6MjZhZjZjN2YtZjc4OS03OGYyLWZhM2ItMjk2MDA1OWM0OGYzIiwiaXNzIjoiaHR0cDovL2hvc3QuZG9ja2VyLmludGVybmFsOjc3NzcvcmVhbG1zL3Nob290ZXItcGxheWVycyIsImF1ZCI6ImFjY291bnQiLCJzdWIiOiI5MjExNzhmMy05YWFjLTRiOTYtYjBiNy1kZWZkNmZhNmY1OWEiLCJ0eXAiOiJCZWFyZXIiLCJhenAiOiJzaG9vdGVyIiwic2lkIjoiNGE4NzdkMjAtYzAwOC1mOGE1LWQyODUtM2U4M2NjMzQ2OTk3IiwiYWNyIjoiMSIsImFsbG93ZWQtb3JpZ2lucyI6WyIvKiJdLCJyZWFsbV9hY2Nlc3MiOnsicm9sZXMiOlsiZGVmYXVsdC1yb2xlcy1zaG9vdGVyLXBsYXllcnMiLCJvZmZsaW5lX2FjY2VzcyIsInVtYV9hdXRob3JpemF0aW9uIl19LCJyZXNvdXJjZV9hY2Nlc3MiOnsiYWNjb3VudCI6eyJyb2xlcyI6WyJtYW5hZ2UtYWNjb3VudCIsIm1hbmFnZS1hY2NvdW50LWxpbmtzIiwidmlldy1wcm9maWxlIl19fSwic2NvcGUiOiJwcm9maWxlIGVtYWlsIiwiZW1haWxfdmVyaWZpZWQiOnRydWUsIm5hbWUiOiJScnIgUnJyIiwicHJlZmVycmVkX3VzZXJuYW1lIjoibmV3X3VzZXJfMDEiLCJnaXZlbl9uYW1lIjoiUnJyIiwiZmFtaWx5X25hbWUiOiJScnIiLCJlbWFpbCI6Im5ld191c2VyXzAxQG1haWwucnUifQ.YWTk7MxHMYmiNZUQPFxTzH8wRjE9b2GhVzi3DteanHABx9tk1cTr84Wv7U2CiyyY0xESVSxLqvsPNBu_RFndGuBvEkUwNWNfXXkIC3Qe463YiWAbVZqkX4VoQ-JFJyFQpQZ2qm2QFMzKcXdMtgwoV1I5X_1Lco4mDEPyFVAFG5yIEkt36f--OcF2So4erBJRoPmRRsBwSx7d6zmtiCejD5ddzmx11pKNp88e3SaWq5vC0b_4ViCZov88RKlMkqNf4w32LMZp79w1ZabLmuYfYfutNPRTsUvY8pLPZ6hdjmND_AIsHXM4_GEXPzodRHB80ILh0BRisTsfDE7IyICfiA</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="Constant Throughput Timer" enabled="true">
            <intProp name="calcMode">0</intProp>
            <doubleProp>
              <name>throughput</name>
              <value>60.0</value>
              <savedValue>0.0</savedValue>
            </doubleProp>
          </ConstantThroughputTimer>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>